package TeamTask01;

public class TeamTask02 {
	
	public static void main(String[] args) {
		
	}
	
//	문제 02. 귀여운 척 금지
//	귀여운 척하는 사람의 말투를 고쳐줍시다.
//	조건에 부합하는 메소드를 작성해서 문장를 교정하세요.
//		[조건]
//		키워드 : ~냥 , ~냠, ~용, ~쪄
//		1. 매개변수 o, 리턴값 o (키워드 포함 여부를 담은 정수형 flag 변수 선언할 것)
//		2. 입력받은 문자열 중에 키워드가  있다면 해당 키워드를 2번 연속 출력하게 문장을 바꿉니다.
//		   그 후 "당신은 귀엽습니다" 문장을 다음 줄에 출력 합니다.
//		3. 만약 키워드가 포함되지 않았다면 "잘하고 있습니다, 앞으로도 그렇게 사용해주세요" 출력
//		4. 키워드가 들어간 문장이 총 3번 이상 입력 되었을때 “그  만!” 문장을 출력시키고 프로그램을 종료시킵니다.
//		5. 메소드 명 : iAmCute
//	출력 결과 )
//	메세지 입력 : 안녕하세용
//	안녕하세용용
//	당신은 귀엽습니다 > <
//	****메세지 입력 : 안녕하세용
//	안녕하세용용
//	당신은 귀엽습니다 > <
//	메세지 입력 : 안녕하세용
//	안녕하세용용
//	메세지 입력 : 안녕하세용
//	그   만 !
	
	
	
}
