package ex03;
//신동석
public class Main {
	public static void main(String[] args) {
		//1. 클래스와 객체에 대해 작성하고 객체를 만들 때 사용되는 생성자에 대해서도 작성하세요.
		//아는 만큼 작성(최대5줄)
		
		// 객체는 heap메모리에 있는 시작주소의 값이다
		// 클래스는 method 영역에 있다
		// 클래스명 객체변수명 = new 클래스명(); 방식으로 만든다
		// 생성자 
		
		//정답
		//클래스는 객체를 생성하기 위한 설계도
		//필드, 메소드, 생성자 (클래스의 주요 구성요소)
		
		//객체 클래스를 기반으로 생성되며, 클래스에서 정의한 필드와 메소드를 사용할 수 있다
		
		//생성자는 객체를 생성할 때 호출되며, 필드값을 초기화하는 역할을 한다
		//생성자의 이름은 클래스 이름과 동일하며 반환타입을 가지지 않는다
		//생성자를 만들지 않으면 컴파일러가 기본 생성자를 만들게 된다
	}
}
